export const PracticeData = [
    {
        "key": 1,
        "nums": "Практическая работа №1",
        "title": "Составление математической модели"
    },
    {
        "key": 2,
        "nums": "Практическая работа №2",
        "title": "Решение задач линейного программирования с использованием графического метода"
    },
    {
        "key": 3,
        "nums": "Практическая работа №3",
        "title": "Решение задач линейного программирования с использованием симплекс-метода"
    },
    {
        "key": 4,
        "nums": "Практическая работа №4",
        "title": "Решение задач линейного программирования с использованием симплекс-метода"
    },
    {
        "key": 5,
        "nums": "Практическая работа №5",
        "title": "Использование табличного симплекс-метода для решения задач линейного программирования"
    },
    {
        "key": 6,
        "nums": "Практическая работа №6",
        "title": "Составление и решение двойственных задач"
    },
    {
        "key": 7,
        "nums": "Практическая работа №7",
        "title": "Построение опорного плана транспортной задачи"
    },
    {
        "key": 8,
        "nums": "Практическая работа №8",
        "title": "Решение транспортных задач с использованием метода потенциалов"
    },
    {
        "key": 9,
        "nums": "Практическая работа №9",
        "title": "Решение транспортных задач с использованием метода потенциалов"
    },
    {
        "key": 10,
        "nums": "Практическая работа №10",
        "title": "Решение задачи о назначении с использованием венгерского метода"
    },
    {
        "key": 11,
        "nums": "Практическая работа №11",
        "title": "Решение задачи построения остовного дерева минимального веса с использованием алгоритмов Прима и Краскала"
    },
    {
        "key": 12,
        "nums": "Практическая работа №12",
        "title": "Решение задачи нахождения кратчайшего пути в графе с использованием алгоритма Дейкстры"
    },
    {
        "key": 13,
        "nums": "Практическая работа №13",
        "title": "Решение задачи нахождения кратчайших путей между всеми парами узлов с использованием алгоритма Флойда"
    },
    {
        "key": 14,
        "nums": "Практическая работа №14",
        "title": "Решение задачи нахождения максимального потока в сети с использованием алгоритма Форда–Фалкерсона"
    },
    {
        "key": 15,
        "nums": "Практическая работа №15",
        "title": "Решение задачи нахождения максимального потока в сети минимальной стоимости с использованием алгоритма Басакера–Гоуэна"
    },
    {
        "key": 16,
        "nums": "Практическая работа №16",
        "title": "Построение сетевой модели. Расчет и количественных характеристик событий и работ"
    },
    {
        "key": 17,
        "nums": "Практическая работа №17",
        "title": "Решение задачи коммивояжера с использованием метода ветвей и границ"
    },
    {
        "key": 18,
        "nums": "Практическая работа №18",
        "title": "Решение задачи коммивояжера с использованием метода ветвей и границ"
    },
    {
        "key": 19,
        "nums": "Практическая работа №19",
        "title": "Решение матричных игр в чистых стратегиях"
    },
    {
        "key": 20,
        "nums": "Практическая работа №20",
        "title": "Решение матричных игр в смешанных стратегиях"
    },
    {
        "key": 21,
        "nums": "Практическая работа №21",
        "title": "Решение матричных игр с использованием графического метода"
    },
    {
        "key": 22,
        "nums": "Практическая работа №22",
        "title": "Решение задач управления запасами с использованием детерминированной однопродуктовой модели"
    }
]